facts-engineering/P1AMCore/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Productivity P1AM-100
# ---------------
P1AM-100_native.name=P1AM-100
P1AM-100_native.vid.0=0x1354
P1AM-100_native.pid.0=0x4000
P1AM-100_native.vid.1=0x1354
P1AM-100_native.pid.1=0x4001

P1AM-100_native.upload.tool=bossac
P1AM-100_native.upload.protocol=sam-ba
P1AM-100_native.upload.maximum_size=262144
P1AM-100_native.upload.use_1200bps_touch=true
P1AM-100_native.upload.wait_for_upload_port=true
P1AM-100_native.upload.native_usb=true
P1AM-100_native.build.mcu=cortex-m0plus
P1AM-100_native.build.f_cpu=48000000L
P1AM-100_native.build.usb_product="P1AM-100"
P1AM-100_native.build.usb_manufacturer="Facts Engineering"
P1AM-100_native.build.board=SAMD_ZERO
P1AM-100_native.build.core=arduino
P1AM-100_native.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
P1AM-100_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
P1AM-100_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
P1AM-100_native.build.variant=P1AM-100
P1AM-100_native.build.vid=0x1354
P1AM-100_native.build.pid=0x4000
P1AM-100_native.bootloader.tool=openocd
P1AM-100_native.bootloader.file=P1AM-100/samd21_sam_ba_arduino_P1AM-100.bin
